"""
1. В этой самой первой миссии вам просто нужно объявить две переменные a, b и установить их значения целыми числами 2, 5 соответственно.
2. По завершении попробуйте задать значения переменных в одной строке (первые переменные получают первое значение и т. д.).
Хотя Python остается динамически типизированным языком, то есть вам не нужно указывать типы для переменных,
включение аннотаций типов, особенно в крупных проектах или при работе в команде,
может значительно повысить качество кода и удобство сопровождения. Стоит отметить, что аннотации типов не являются обязательными,
и Python не обеспечивает строгую типизацию; они служат в первую очередь средством помощи в целях развития и документирования.
3. Для целых чисел используйте тип int. Перепишите первый вариант с аннотацией типа.
"""
a: int = 2
b: int = 5