"""
Сохраняя в памяти свои знания о переменных и операциях с ними, сделаем шаг в сторону и поговорим о функциях.
Функция — это блок кода, который можно использовать несколько раз в разных местах.
Обычно функция получает какие-то входные данные (параметры), производит с ними какие-то операции и возвращает какое-то значение наружу.

1. В этой миссии вам нужно определить функцию func, которая не принимает аргументов.

2. Ваша функция тоже ничего делать не собирается! Чтобы код (выражение) работал правильно, ничего не делая,
вам нужно использовать так называемые заполнители: проход ключевого слова или оператор ....

3. Обратите внимание: даже если функция ничего не возвращает, она все равно возвращает пустое значение None.
"""
# write your code here
def func():
    a = None
    return a