"""
1. Давайте введем две новые переменные с именами add, multi.
Присвойте им значения, равные сумме и произведению соответственно ранее объявленных переменных a, b.

2. Использование выражений позволяет позже легко изменять значения a, b, обеспечивая при этом точные значения для add, multi.
Не стесняйтесь отрегулировать a, b, а затем нажмите «Проверить решение».
Если вы выразите add, multi, вы все равно успешно выполните эту задачу.
"""

# Taken from mission Variable: Declaration and Value Setting

# write your code here
a: int = 2
b: int = 5


# write your code here
add = a + b
multi = a * b